app/controllers/record_controller.rb

SELECT * FROM "records" WHERE ("records"."id" = 71538)
---
  def show
    @r = Record.find(params[:id], :include => [:mesh_terms, {:article => {:assigned_mesh_terms => :mesh_term}}])